Revit 2017 API
DirectShape.CreateElementInstance Method
Overload List
Name | Description
CreateElementInstance(Document, ElementId, ElementId, String, Transform)
 Creates a DirectShape object and adds it to document.
CreateElementInstance(Document, ElementId, ElementId, String, Transform, String, String) |  Obsolete.
 Creates a DirectShape object and adds it to document. The shape stored in the element is either a reference or a copy of a definition shape that was created earlier. How the definitions are stored will determine whether an instance or a copy of the shape will be created. See DirectShapeLibrary for more details. This function is included for convenience. It essentially combines CreateGeometryInstance and CreateElement.
See Also
DirectShape Class
DirectShape Members
Autodesk.Revit.DB Namespace